       IDENTIFICATION DIVISION.
       PROGRAM-ID. METASUM RECURSIVE.
       AUTHOR. OK999
      *
       DATA DIVISION.
       WORKING-STORAGE SECTION.
          01 WS-SUM PIC 9(18) USAGE BINARY VALUE 0.
       LOCAL-STORAGE SECTION.
          01 LS-HEADER.
             03 LS-CHILD PIC 9(4) USAGE BINARY.
             03 LS-META PIC 9(4) USAGE BINARY.
          01 LS-TMP PIC 9(4) USAGE BINARY.
       LINKAGE SECTION.
          01 L-IDX PIC 9(5) USAGE BINARY.
          01 L-TREE.
             03 L-LENGTH PIC 9(5) USAGE BINARY.
             03 L-TREE-TABLE OCCURS 20000.
                05 L-E PIC 9(4) USAGE BINARY.
      *
       PROCEDURE DIVISION USING L-IDX, L-TREE.
       COMPUTE-METASUM SECTION.
          IF L-IDX > L-LENGTH THEN
             EXIT PROGRAM RETURNING WS-SUM
          END-IF.
          MOVE L-E (L-IDX) TO LS-CHILD.
          ADD 1 TO L-IDX.
          MOVE L-E (L-IDX) TO LS-META.
          ADD 1 TO L-IDX.
          PERFORM VARYING LS-TMP FROM 1 BY 1 UNTIL LS-TMP > LS-CHILD
             CALL "METASUM" USING L-IDX, L-TREE
          END-PERFORM.
          PERFORM VARYING LS-TMP FROM 1 BY 1 UNTIL LS-TMP > LS-META
             ADD L-E (L-IDX) TO WS-SUM
             ADD 1 TO L-IDX
          END-PERFORM.
          EXIT PROGRAM RETURNING WS-SUM.
